import React, { Component } from "react";
import { Modal } from "antd";
import "./protocol.css";

export default class Protocol extends Component {
  render() {
    return (
      <Modal
        className="agreement-modal"
        title="入会協定"
        footer={null}
        keyboard={false}
        width={1024}
        {...this.props}
      >
        <div className="agreement-cont">
          <p>
            雨島プラットフォームの所有者である雨島株式会社が提供するネットワークサービスを歓迎し、その目的は雨島会員のために専属クラブを作り、予想以上の良質なサービスを提供することである。
          </p>
          <p>
            雨島プラットフォームを通じて認証を登録し、一定の入会条件を満たすと雨島会員（以下「会員」または「雨島会員」と略称する）になり、会員は雨島プラットフォームが提供する商品の注文などのサービスを受けることができる。
          </p>

          <h4>第一条　会員の権利と義務</h4>
          <p>
            （一）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （二）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （三）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （四）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （五）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <h4>第二条　会員のプライバシー権保護</h4>
          <p>
            （一）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （二）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （三）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （四）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （五）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <h4>第三条　サービス及び約定</h4>
          <p>
            （一）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （二）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （三）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （四）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （五）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <h4>第四条　サービスの変更と終了</h4>
          <p>
            （一）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （二）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （三）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （四）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
          <p>
            （五）会員はコンピュータ及びインターネット規定に関する法律と法規、実施方法を遵守することに同意する。ここで、会員に関連リスクを明確に開示し、提示し、提示してもらう：雨島プラットフォームが合理的に会員の行為が上述の法律、法規に違反する可能性があると判断した場合、雨島プラットフォームは事前通知なしに当該会員へのサービス提供を中止したり、会員資格を取り消したりする権利があり、雨島プラットフォームはいかなる違約及び損失賠償責任も負わない。
          </p>
        </div>
      </Modal>
    );
  }
}
